ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32H5xx/stm32h562xx.h
/****************** UART Instances : Hardware Flow control ********************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                           ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                           ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                           ((INSTANCE) == UART4_NS)   || ((INSTANCE) == UART4_S)   || \
                                           ((INSTANCE) == UART5_NS)   || ((INSTANCE) == UART5_S)   || \
                                           ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                           ((INSTANCE) == UART7_NS)   || ((INSTANCE) == UART7_S)   || \
                                           ((INSTANCE) == UART8_NS)   || ((INSTANCE) == UART8_S)   || \
                                           ((INSTANCE) == UART9_NS)   || ((INSTANCE) == UART9_S)   || \
                                           ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                           ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S) || \
                                           ((INSTANCE) == UART12_NS)  || ((INSTANCE) == UART12_S)  || \
                                           ((INSTANCE) == LPUART1_NS) || ((INSTANCE) == LPUART1_S))

/******************** UART Instances : LIN mode **********************/
#define IS_UART_LIN_INSTANCE(INSTANCE)   (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                          ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                          ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                          ((INSTANCE) == UART4_NS)   || ((INSTANCE) == UART4_S)   || \
                                          ((INSTANCE) == UART5_NS)   || ((INSTANCE) == UART5_S)   || \
                                          ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                          ((INSTANCE) == UART7_NS)   || ((INSTANCE) == UART7_S)   || \
                                          ((INSTANCE) == UART8_NS)   || ((INSTANCE) == UART8_S)   || \
                                          ((INSTANCE) == UART9_NS)   || ((INSTANCE) == UART9_S)   || \
                                          ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                          ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S) || \
                                          ((INSTANCE) == UART12_NS)  || ((INSTANCE) == UART12_S))

/******************** UART Instances : Wake-up from Stop mode **********************/
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE)   (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                                      ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                                      ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                                      ((INSTANCE) == UART4_NS)   || ((INSTANCE) == UART4_S)   || \
                                                      ((INSTANCE) == UART5_NS)   || ((INSTANCE) == UART5_S)   || \
                                                      ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                                      ((INSTANCE) == UART7_NS)   || ((INSTANCE) == UART7_S)   || \
                                                      ((INSTANCE) == UART8_NS)   || ((INSTANCE) == UART8_S)   || \
                                                      ((INSTANCE) == UART9_NS)   || ((INSTANCE) == UART9_S)   || \
                                                      ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                                      ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S) || \
                                                      ((INSTANCE) == UART12_NS)  || ((INSTANCE) == UART12_S)  || \
                                                      ((INSTANCE) == LPUART1_NS) || ((INSTANCE) == LPUART1_S))

/*********************** UART Instances : IRDA mode ***************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                    ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                    ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                    ((INSTANCE) == UART4_NS)   || ((INSTANCE) == UART4_S)   || \
                                    ((INSTANCE) == UART5_NS)   || ((INSTANCE) == UART5_S)   || \
                                    ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                    ((INSTANCE) == UART7_NS)   || ((INSTANCE) == UART7_S)   || \
                                    ((INSTANCE) == UART8_NS)   || ((INSTANCE) == UART8_S)   || \
                                    ((INSTANCE) == UART9_NS)   || ((INSTANCE) == UART9_S)   || \
                                    ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                    ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S) || \
                                    ((INSTANCE) == UART12_NS)  || ((INSTANCE) == UART12_S))

/********************* USART Instances : Smard card mode ***********************/
#define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                         ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                         ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                         ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                         ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                         ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S))

/******************** LPUART Instance *****************************************/
#define IS_LPUART_INSTANCE(INSTANCE)    (((INSTANCE) == LPUART1_NS) || ((INSTANCE) == LPUART1_S))

/******************** CEC Instance *****************************************/
#define IS_CEC_ALL_INSTANCE(INSTANCE)    (((INSTANCE) == CEC_NS) || ((INSTANCE) == CEC_S))

/****************************** IWDG Instances ********************************/
#define IS_IWDG_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == IWDG_NS) || ((INSTANCE) == IWDG_S))

/****************************** WWDG Instances ********************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == WWDG_NS) || ((INSTANCE) == WWDG_S))

/****************************** UCPD Instances ********************************/
#define IS_UCPD_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == UCPD1_NS) || ((INSTANCE) == UCPD1_S))

/******************************* USB DRD FS HCD Instances *************************/
#define IS_HCD_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB_DRD_FS_NS) || ((INSTANCE) == USB_DRD_FS_S))

/******************************* USB DRD FS PCD Instances *************************/
#define IS_PCD_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB_DRD_FS_NS) || ((INSTANCE) == USB_DRD_FS_S))


/** @} */ /* End of group STM32H5xx_Peripheral_Exported_macros */

/** @} */ /* End of group STM32H562xx */

/** @} */ /* End of group ST */

#ifdef __cplusplus
}
#endif

#endif  /* STM32H562xx_H */
